Tests/Fixtures/Extensions/expected.separate.puml
@startuml
hide empty members
interface "Codable" as Codable <<protocol>> {
}
class "Profile" as Profile <<struct>> {
}
class "Team" as Team <<struct>> {
    users : [User]
}
class "User" as User <<struct>> {
    profile : Profile
    {static} make() : User
    mutating rename(to name: String)
}
class "extension User" as __extension_0_User <<extension>> {
    displayName : String
    {static} preview() : User
}
User <.. __extension_0_User : extends
Codable <|.. __extension_0_User
Team o-- User : users
User *-- Profile : profile
@enduml
